[
  {
    "icon": "Java",
    "image": "/icon/java.png",
    "title": "Java",
    "subtitle": "Programming Language",
    "description": "Java is a popular, class-based, object-oriented programming language designed to be platform-independent, allowing code to be written once and run anywhere."
  },
  {
    "icon": "IconReact",
    "image": "/icon/icon-react.svg",
    "title": "React JS",
    "subtitle": "Next.js, Vercel",
    "description": "Using React, I craft scalable user interfaces with components, state management, and virtual DOM manipulation for seamless web applications."
  },
  {
    "icon": "IconDocker",
    "image": "/icon/docker.png",
    "title": "Docker",
    "subtitle": "Containerization Platform",
    "description": "Docker is an open platform for developing, shipping, and running applications inside isolated environments called containers."
  },
  {
    "icon": "IconSpringBoot",
    "image": "/icon/springboot.png",
    "title": "SpringBoot",
    "subtitle": "Application Framework",
    "description": "Spring Boot is an open-source Java-based framework used to simplify the creation of stand-alone, production-grade Spring applications that you can just run."
  },
  {
    "icon": "IconProgramming",
    "image": "/icon/Python.svg",
    "title": "Python",
    "subtitle": "Programming",
    "description": "From automation scripts to data analysis, Python powers diverse applications with simplicity and efficiency."
  },
  {
    "icon": "IconNode",
    "image": "/icon/Node.svg",
    "title": "Node.js",
    "subtitle": "Web Accessibility",
    "description": "Accessibility is a must. I ensure everyone can use what I create, focusing on keyboard navigation and screen reader compatibility."
  },
  {
    "icon": "IconMongodb",
    "image": "/icon/mongodb-icon.svg",
    "title": "Database",
    "subtitle": "Mongodb",
    "description": "MongoDB accelerates data-driven insights with its flexible NoSQL database, empowering scalable and efficient storage solutions."
  },
  {
    "icon": "IconSql",
    "image": "/icon/mysql-official.svg",
    "title": "Database",
    "subtitle": "MySQL",
    "description": "MySQL fuels dynamic websites and applications with its robust database management capabilities, ensuring seamless data storage and retrieval."
  },
  {
    "icon": "IconGit",
    "image": "/icon/github-mark.svg",
    "title": "Github",
    "subtitle": "Deploy and Development",
    "description": "GitHub's deployment features streamline the process of pushing code changes to production, ensuring rapid and efficient deployment workflows."
  },
  {
    "icon": "IconTypeScript",
    "image": "/icon/typescript.png",
    "title": "TypeScript",
    "subtitle": "Developing and Maintaining",
    "description": "TypeScript is used to add static types to JavaScript, which helps catch errors during development and makes code more robust and easier to maintain for large-scale applications."
  },
  {
    "icon": "Tailwind",
    "image": "/icon/tailwind.png",
    "title": "Tailwind",
    "subtitle": "Website Styling",
    "description": "Tailwind is a utility-first CSS framework that lets you build custom designs rapidly by applying pre-made classes directly within your HTML."
  },
  {
    "icon": "IconNext",
    "image": "/icon/Nextjs-logo.svg",
    "title": "Next.js",
    "subtitle": "Development",
    "description": "Next.js simplifies server-side rendering and static site generation for React applications, boosting performance and SEO."
  },
  {
    "icon": "ExpressJs",
    "image": "/icon/express.png",
    "title": "Express.js",
    "subtitle": "Web Application FrameWork",
    "description": "Express.js is a minimal and flexible back-end web framework for Node.js used to build web applications and APIs."
  }
  
]